GROUPS_BY_COURSE = {
    "1 курс": [
        "1а1", "1бд1", "1бд3", "1бп1", "1бу1", "1бу3", "1вб1", "1вб2", "1вб3(б)",
        "1д1", "1д3", "1ис1", "1ис2", "1ис3", "1м1", "1пк1", "1пк2", "1р1", "1р3",
        "1са1", "1са2", "1са3"
    ],
    "2 курс": [
        "2а1", "2бд1", "2бд3", "2бп3", "2бу1", "2бу3", "2вб1", "2вб2", "2вб3",
        "2д1", "2д3", "2ис1", "2ис3", "2м1", "2пк1", "2пк2", "2р1", "2р3",
        "2са1", "2са3"
    ],
    "3 курс": [
        "3а1", "3бд1", "3бд3", "3бу1", "3бу3", "3вб1", "3вб2", "3вб3", "3д1",
        "3д3", "3ис1", "3ис3", "3м1", "3пк1", "3пк2", "3р1", "3р3", "3са1", "3са3"
    ],
    "4 курс": [
        "4бу1", "4вб1", "4вб2", "4вб3", "4д1", "4ис1", "4ис3", "4м1", "4пк1",
        "4пк2", "4р1", "4р3"
    ]
}

DAYS_MAPPING = {
    "Понедельник": "monday",
    "Вторник": "tuesday",
    "Среда": "wednesday",
    "Четверг": "thursday",
    "Пятница": "friday",
    "Суббота": "saturday",
    "Вся неделя": "week",
    "Сменить группу": "change_group"
}

ADMIN_PASSWORD = "12345"